In [3]:
# Assignment_1
Data Filtering and Manipulation with Pandas
Objective:
In this assignment, you will demonstrate your ability to work with Pandas, a popular Python library for data manipulation, by filtering and manipulating a custom CSV dataset.

Instructions:
Dataset: You will be provided with a CSV file named "students.csv." This file contains information about students, including their names, ages, and cities.

Task: Your task is to create a Python script that reads the CSV dataset, uses the filter_dataframe function (which you must create), and answers specific questions related to data filtering and manipulation.

Function Description: This function takes three arguments: a Pandas DataFrame, a column name, and a filter value. It returns a new data frame containing only the rows where the specified column's value matches the given filter value.  

Questions for this assignment
How many students are there in the dataset who are from 'San Francisco'?

What is the average age of students from 'Chicago'?

Create a new DataFrame that contains only the students who are 30 years old or older. How many students meet this criterion?

In [4]:
import pandas as pd

In [23]:
#reading the csv file 

df=pd.read_csv('students.csv')
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago
4      Eve   25       New York
5    Frank   28         Boston
6    Grace   22  San Francisco
7    Helen   32    Los Angeles
8      Ivy   29        Chicago
9     Jack   26       New York

In [ ]:
# methods of object df 

df.head()
df.info()
df.describe()

# Q1: How many students are there in the dataset who are from 'San Francisco'?

In [31]:
# accessing city col from dataframe df
city_filter= df['City'].str.strip() =='San Francisco' #str.strip()removes any leading or trailing spaces from each value in that column
city_filter

0    False
1     True
2    False
3    False
4    False
5    False
6     True
7    False
8    False
9    False
Name: City, dtype: bool

In [28]:
# only students who are from San francisco
sf_students= df[city_filter]
sf_students

    Name  Age           City
1    Bob   30  San Francisco
6  Grace   22  San Francisco

# Q2: What is the average age of students from 'Chicago'?

In [36]:
age_filter= df['Age'].mean()

print("Average age of students:", age_filter)

Average age of students: 29.2

In [39]:
# finding students from chicago 
chicago_students= df['City'].str.strip() == 'Chicago'
chicago_students

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7    False
8     True
9    False
Name: City, dtype: bool

In [42]:
chi_students = df[chicago_students]
chi_students

    Name  Age     City
3  David   40  Chicago
8    Ivy   29  Chicago

In [44]:
average_age_chi = chi_students['Age'].mean()
print("Average age of students from Chicago:", average_age_chi)

Average age of students from Chicago: 34.5

# Q3. Create a new DataFrame that contains only the students who are 30 years old or older. How many students meet this criterion?

In [47]:
student_thirty= df[df['Age'] >= 30]
student_thirty

      Name  Age           City
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago
7    Helen   32    Los Angeles

In [48]:
num_students_30_or_older = len(student_thirty)
print("Number of students aged 30 or older:", num_students_30_or_older)

Number of students aged 30 or older: 4